"""
.  任意一个 除了 \n
\d \D 数字和非数字
\w \W 单词和非单词 例如 a-z A-Z 0-9 _ 以及其他语言
[aeiou] [^aeiou] 指定的单个字符 以及取反
[0-9] 表示范围

* 出现任意次
+ 至少出现一次（出现）
？ 至多出现一次（存在）
{m} 出现m次
{m,n} 出现m-n次
{m,} 至少出现m次
| 或 左右任意一个
（） 分组
^ $ 开头和结尾

"""
import re
s = '14345678900'
re.findall(r'134\d{8}',s)#匹配手机号
re.findall(r'1[^38]\d{9}',s)#第二位部位38的手机号
re.findall(r'^1[38]\d{9}',s)#以手机号开头且第二位是3或8

w = 'Sarck my_dike,123456789@qq.com'
re.findall(r'\w@\w\.\w',w)#匹配邮箱
re.findall(r'\w@\w\.\w',w,re.ASCII)#第三个参数可以进一步筛选
#                                           此处限制为字母数字

t = '现在是14:54,今天是2025年2月6号'
re.findall(r'\d{2}:\d{2}',t)#匹配时间
re.findall(r'(\d{4})-(\d{1,2})-(\d{1,2})',t)#匹配日期，分组返回列表
